import omlet from "../assets/foods/omlet.png";
import borito from "../assets/foods/borito.png";
import morq from "../assets/foods/morq.png";
import salad from "../assets/foods/salad.png";
import lazania from "../assets/foods/lazania.jpg";

import imag1 from "../assets/icons/1.png";
import image2 from "../assets/icons/2.png";
import image3 from "../assets/icons/3.png";
import image4 from "../assets/icons/4.png";
import image5 from "../assets/icons/5.png";
import image6 from "../assets/icons/6.png";
import image7 from "../assets/icons/7.png";
import image8 from "../assets/icons/8.png";
import image9 from "../assets/icons/9.png";
import image10 from "../assets/icons/10.png";
import image11 from "../assets/icons/11.png";
import image12 from "../assets/icons/12.png";
import image13 from "../assets/icons/13.png";
import image14 from "../assets/icons/14.png";
import image15 from "../assets/icons/15.png";
import image16 from "../assets/icons/16.png";
import image17 from "../assets/icons/17.png";
import image18 from "../assets/icons/18.png";
import image19 from "../assets/icons/19.png";
import image20 from "../assets/icons/20.png";
import image21 from "../assets/icons/21.png";
import image22 from "../assets/icons/22.png";
import image23 from "../assets/icons/23.png";
import image24 from "../assets/icons/24.png";
import image25 from "../assets/icons/25.png";

export const started = [
  { id: 1, title: "سیب زمینی", image: imag1 },
  { id: 2, title: "نخود", image: image2 },
  { id: 3, title: "فلفل دلمه ای", image: image3 },
  { id: 4, title: "گوجه فرنگی", image: image4 },
  { id: 5, title: "نمک و فلفل سیاه", image: image5 },
  { id: 6, title: "گوشت", image: image6 },
  { id: 7, title: "ماکارونی", image: image7 },
  { id: 8, title: "پیاز", image: image8 },
  { id: 9, title: "قارچ", image: image9 },
  { id: 10, title: "زردچوبه", image: image10 },
  { id: 11, title: "لوبیا", image: image11 },
  { id: 12, title: "لیمو", image: image12 },
  { id: 13, title: "مرغ", image: image13 },
  { id: 14, title: "تخم مرغ", image: image14 },
  { id: 15, title: "کره", image: image15 },
  { id: 16, title: "کشمش", image: image16 },
  { id: 17, title: "روغن", image: image17 },
  { id: 18, title: "برنج", image: image18 },
  { id: 19, title: "عدس", image: image19 },
  { id: 20, title: "شکر", image: image20 },
  { id: 21, title: "چوب دارچین", image: image21 },
  { id: 22, title: "آویشن", image: image22 },
  { id: 23, title: "سیر", image: image23 },
  { id: 24, title: "جعفری", image: image24 },
  { id: 25, title: "سس گوجه", image: image25 },
];

export const menuTop1 = [
  { id: 1, title: "خانه", paths: "/" },
  { id: 2, title: "دستور پخت", paths: "/SugestFood" },
  { id: 3, title: "درباره ما", paths: "/" },
];

export const foods = [
  {
    id: 1,
    title: "املت کینوا",
    desc: "غذای سریع",
    view: 12,
    image: omlet,
    desc1: "روش تهیه",
    recipe: `
    پخت کینوا: ابتدا کینوا را بشویید و آن را در آب جوش بپزید تا نرم و پخته شود (حدود 15 دقیقه). می‌توانید از قبل کینوا را بپزید و در یخچال نگه دارید.
    `,
    recipe2: `
    آماده کردن سبزیجات: سبزیجات مورد نظر خود را خرد کنید. مثلاً گوجه فرنگی را نگینی و پیاز و فلفل دلمه‌ای را به تکه‌های کوچک برش دهید.
    `,
    recipe3: `
    پخت سبزیجات: در یک تابه، روغن زیتون را گرم کرده و سبزیجات خرد شده را به مدت چند دقیقه تفت دهید تا نرم شوند.
    `,
    recipe4: `
    اضافه کردن تخم‌مرغ: تخم‌مرغ‌ها را در یک کاسه بشکنید و با کمی نمک و فلفل زده تا خوب مخلوط شوند. سپس این مخلوط را به مواد داخل تابه اضافه کرده و حرارت را کم کنید. بگذارید تا تخم‌مرغ‌ها به آرامی بپزند و کمی طلایی شوند.
    `,
    recipe5: `
    سرو کردن: وقتی املت آماده شد، آن را در بشقاب قرار داده و می‌توانید با پنیر رنده شده یا سبزیجات تازه تزئین کنید.
    `,
  },

  {
    id: 2,
    title: "گوشت با پنیر گریل شده",
    desc: "غذای سریع",
    view: 23,
    image: morq,
    desc1: "روش تهیه",
    recipe: `
    آماده کردن گوشت: گوشت را به قطعات مناسب برای گریل تقسیم کنید. در صورتی که از استیک گوساله یا فیله استفاده می‌کنید، می‌توانید آن را با نمک و فلفل مزه‌دار کنید. در صورت تمایل، کمی سیر خرد شده و سبزیجات معطر را نیز به گوشت اضافه کنید.
    `,
    recipe2: `
    پخت گوشت: یک تابه را با روغن زیتون گرم کنید. گوشت را در تابه گذاشته و از هر دو طرف آن را تا زمانی که به دمای دلخواه شما برسد (برای استیک معمولاً 3-5 دقیقه هر طرف کافی است) گریل کنید. اگر گوشت ضخیم باشد، ممکن است زمان بیشتری لازم باشد.
    `,
    recipe3: `
    اضافه کردن پنیر: بعد از پخت گوشت، قطعات پنیر را روی گوشت قرار دهید و تابه را پوشانده تا پنیر ذوب شود. می‌توانید پنیر را روی گوشت‌های پخته قرار دهید و اجازه دهید تا به صورت طبیعی ذوب شود، یا از حرارت مستقیم گریل برای ذوب شدن پنیر استفاده کنید.
    `,
    recipe4: `
    آماده کردن نان: در همین حین، نان‌ها را گریل کرده و کمی روغن زیتون روی آن‌ها بزنید.
    `,
    recipe5: `
    سرو کردن: گوشت با پنیر گریل شده را بر روی نان‌های گریل شده قرار دهید و با سبزیجات تازه یا سالاد دلخواه سرو کنید
    `,
  },
  {
    id: 3,
    title: "مرغ بوریتو",
    desc: "غذای سریع",
    view: 53,
    image: borito,
    desc1: "روش تهیه",
    recipe: `
    مرغ را آماده کنید: مرغ را به تکه‌های کوچک تقسیم کنید. آن را با ادویه‌ها (نمک، فلفل سیاه، پودر چیلی، پودر سیر، پودر زیره) و روغن زیتون مزه‌دار کنید. سپس مرغ را در یک ماهیتابه روی حرارت متوسط بپزید تا زمانی که به طور کامل پخته و طلایی شود.
    `,
    recipe2: `
    آماده کردن مواد دیگر: در همین حین، آووکادو را به شکل ورقه‌های نازک برش دهید، گوجه فرنگی را نگینی خرد کنید و کاهو را شسته و ریز کنید.
    `,
    recipe3: `
    ساخت بوریتو: یک تورتیلا را بردارید، مرغ پخته شده را در مرکز آن قرار دهید و سپس آووکادو، گوجه فرنگی، کاهو و پنیر (اگر استفاده می‌کنید) را اضافه کنید.
    `,
    recipe4: `
    لفاف بوریتو: دو طرف تورتیلا را به داخل تا کرده و سپس آن را از پایین به بالا رول کنید تا مواد داخل آن محفوظ بمانند.
    `,
    recipe5: `
   سرو کردن: بوریتوها را با سس دلخواه (مثلاً سس ماست یا سس سالسا) سرو کنید.
    `,
  },
  {
    id: 4,
    title: "لازانیا",
    desc: "غذای سریع",
    view: 10,
    image: lazania,
    desc1: "روش تهیه",
    recipe: `
    گوشت چرخ کرده با پیاز و سیر تفت داده شده و سس گوجه‌فرنگی به آن اضافه می‌شود
    `,
    recipe2: `
    سس سفید (بشامل) با کره، آرد و شیر تهیه می‌شود.
    `,
    recipe3: `
    ورق‌های لازانیا به صورت لایه‌لایه با سس گوشتی و سس سفید ترکیب می‌شوند.
    `,
    recipe4: `
    پنیر موزارلا و پارمزان رنده شده بین لایه‌ها قرار می‌گیرند.
    `,
    recipe5: `
   لازانیا در فر با دمای 180 درجه سانتی‌گراد برای 30-40 دقیقه پخته می‌شود.
    `,
  },
  {
    id: 5,
    title: "سالاد مرغ",
    desc: "غذای سریع",
    view: 10,
    image: salad,
    desc1: "روش تهیه",
    recipe: `
    پخت مرغ: ابتدا مرغ را به صورت کامل یا تکه‌های کوچک در آب با کمی نمک و ادویه‌ها (مانند زردچوبه و فلفل سیاه) بپزید. پس از پخت، مرغ را ریش‌ریش کنید تا به راحتی در سالاد ترکیب شود.
    `,
    recipe2: `
    اضافه کردن سبزیجات: کاهو، گوجه‌فرنگی، خیار و هویج رنده شده را به مرغ ریش‌ریش شده اضافه کنید. شما می‌توانید از سبزیجات دلخواه خود مانند فلفل دلمه‌ای یا کلم برگ نیز استفاده کنید تا سالاد رنگارنگ و خوشمزه‌تر شود.
    `,
    recipe3: `
    اضافه کردن آووکادو و ذرت: برای طعم و بافت بهتر، آووکادو برش داده شده و ذرت پخته شده را به سالاد اضافه کنید. آووکادو به سالاد لطافت خاصی می‌دهد و ذرت طعم شیرینی به آن می‌بخشد.
    `,
    recipe4: `
    تهیه سس مخصوص سالاد: برای سس، می‌توانید از ترکیب سس مایونز و ماست استفاده کنید تا سالاد مرطوب و خوشمزه شود. اگر می‌خواهید طعمی تندتر داشته باشید، سس خردل نیز گزینه مناسبی است. کمی نمک، فلفل و لیموترش یا سرکه هم به سس اضافه کنید تا طعم آن بهتر شود.
    `,
    recipe5: `
    سرو و تزئین: سالاد مرغ را در ظرفی زیبا سرو کنید و برای تزئین می‌توانید از جعفری تازه یا بادام خرد شده استفاده کنید. این سالاد خوشمزه و سالم می‌تواند یک وعده ناهار یا پیش‌غذای عالی باشد.
    `,
  },
];
